const prefixes = [
    "",
    "лен",
    "мос",
    "рос",
    "рост",
    "нац",
    "регион",
    "урал",
    "союз",
    "сов",
]

const inner = [
    "гос",
    "гейм",
    "плод",
    "пром",
    "прод",
    "овощ",
    "агро",
    "мясо",
    "теле",
    "радио",
    "резино",
    "культ",
    "мед",
    "тех",
    "фин",
    "авто",
    "худ",
    "орг",
    "электро",
    "авиа",
    "обр",
    "алко",
    "жил",
    "водо",
    "хим",
    "хоз",
    "сельхоз",
    "игро",
    "транс",
    "кино",
    "пласт",
    "инфо",
    "информ",
    "соц",
    "групп",
    "газ",
    "строй",
    "нефте",
    "муз",
    "хлеб",
    "рыб",
    "снаб",
    "лес",
    "нар",
    "народ",
    "кибер",
    "спорт",
    "платёж",
    "раб",
    "воен",
    "вкусно",
    "вкус",
    "здрав",
    "тур",
    "секс",
    "порно",
    "гор",
    "пище",
    "вагон",
    "техно",
    "медиа",
    "уголь",
    "сталь",
    "никель",
    "интер",
    "связь",
    "импорто",
    "энерго",
    "атом",
]

const suffixes = [
    "торг",
    "рыб",
    "ком",
    "фонд",
    "пром",
    "снаб",
    "строй",
    "проект",
    "текстиль",
    "просвет",
    "комплекс",
    "вет",
    "тур",
    "комбинат",
    "экспорт",
    "импорт",
    "лизинг",
    "банк",
    "инвест",
    "бетон",
    "мебель",
    "сервис",
    "продукт",
    "страх",
    "атом",
    "связь",
    "банк",
    "реестр",
    "снабжение",
    "нефть",
    "еда",
    "предприятие",
    "управление",
    "котлета",
    "экспертиза",
    "служба",
    "безопасность",
    "бургер",
    "центр",
    "авто",
    "тех",
    "трест",
    "надзор",
    "охрана",
    "космос",
    "хлеб",
    "канал",
    "техника",
    "транспорт",
    "кола",
    "кино",
    "тефтельки",
    "картошка",
    "эротика",
    "конструктор",
    "стриминг",
    "кофе",
    "отдых",
    "бюро",
    "грам",
    "бронирование",
    "облако",
    "напиток",
    "точка",
    "план",
    "консалтинг",
    "изделия",
    "программы",
    "зрелище",
    "печать",
    "спорт",
    "клуб",
    "туризм",
    "гвардия",
    "услуги",
    "косметика",
    "такси",
    "коворкинг",
    "знакомства",
    "футболки",
    "трусы",
    "штаны",
    "кроссовки",
    "станок",
    "замещение",
];

function generate() {
    let prefix = rand(prefixes)

    let innerCount = rand([1, 2, 3])
    if (prefix === "") {
        innerCount = rand([2, 3])
    }

    let inners = []
    let newInner
    for (let i = 0; i < innerCount; i++) {
        do {
            newInner = rand(inner)
        } while (inners.includes(newInner))
        inners.push(newInner)
    }

    let innersPrepared = ""
    inners.forEach(function (inner) {
        innersPrepared += capitalize(inner + `\&shy;`)
    })

    let suffix
    do {
        suffix = rand(suffixes)
    } while (inners.includes(suffix));

    return (capitalize(prefix + `\&shy;`) + innersPrepared + capitalize(suffix));
}

function rand(list) {
    return list[Math.floor(Math.random() * list.length)];
}

function capitalize(string) {
    return string.charAt(0).toUpperCase() + string.slice(1);
}
